python/full-report-dynamo.log
Change only number of rows
Entity rows: 1; Features: 50; Concurrency: 5; RPS: 10
vegeta attack -format json -targets requests-1-50.json -connections 5 -duration 1m -rate 10/1s -timeout 5s | vegeta report
Requests      [total, rate, throughput]         600, 10.02, 10.01
Duration      [total, attack, wait]             59.938s, 59.9s, 38.126ms
Latencies     [min, mean, 50, 90, 95, 99, max]  29.301ms, 39.727ms, 34.631ms, 47.673ms, 75.296ms, 129.397ms, 145.131ms
Bytes In      [total, mean]                     3203562, 5339.27
Bytes Out     [total, mean]                     43126, 71.88
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:600  
Error Set:
Entity rows: 10; Features: 50; Concurrency: 5; RPS: 10
vegeta attack -format json -targets requests-10-50.json -connections 5 -duration 1m -rate 10/1s -timeout 5s | vegeta report
Requests      [total, rate, throughput]         600, 10.02, 10.01
Duration      [total, attack, wait]             59.953s, 59.9s, 53.47ms
Latencies     [min, mean, 50, 90, 95, 99, max]  45.224ms, 55.913ms, 52.607ms, 66.389ms, 74.864ms, 99.111ms, 137.756ms
Bytes In      [total, mean]                     15352700, 25587.83
Bytes Out     [total, mean]                     74957, 124.93
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:600  
Error Set:
Entity rows: 20; Features: 50; Concurrency: 5; RPS: 10
vegeta attack -format json -targets requests-20-50.json -connections 5 -duration 1m -rate 10/1s -timeout 5s | vegeta report
Requests      [total, rate, throughput]         600, 10.02, 10.00
Duration      [total, attack, wait]             59.97s, 59.9s, 70.285ms
Latencies     [min, mean, 50, 90, 95, 99, max]  60.917ms, 73.382ms, 68.618ms, 87.089ms, 107.73ms, 122.202ms, 223.129ms
Bytes In      [total, mean]                     28846497, 48077.50
Bytes Out     [total, mean]                     110249, 183.75
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:600  
Error Set:
Entity rows: 30; Features: 50; Concurrency: 5; RPS: 10
vegeta attack -format json -targets requests-30-50.json -connections 5 -duration 1m -rate 10/1s -timeout 5s | vegeta report
Requests      [total, rate, throughput]         600, 10.02, 10.00
Duration      [total, attack, wait]             59.991s, 59.9s, 90.717ms
Latencies     [min, mean, 50, 90, 95, 99, max]  75.886ms, 89.919ms, 85.528ms, 103.407ms, 122.219ms, 139.927ms, 183.561ms
Bytes In      [total, mean]                     42324229, 70540.38
Bytes Out     [total, mean]                     145591, 242.65
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:600  
Error Set:
Entity rows: 40; Features: 50; Concurrency: 5; RPS: 10
vegeta attack -format json -targets requests-40-50.json -connections 5 -duration 1m -rate 10/1s -timeout 5s | vegeta report
Requests      [total, rate, throughput]         600, 10.02, 10.00
Duration      [total, attack, wait]             1m0s, 59.9s, 125.69ms
Latencies     [min, mean, 50, 90, 95, 99, max]  93.367ms, 107.028ms, 102.686ms, 119.536ms, 137.379ms, 163.022ms, 217.502ms
Bytes In      [total, mean]                     55833078, 93055.13
Bytes Out     [total, mean]                     180966, 301.61
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:600  
Error Set:
Entity rows: 50; Features: 50; Concurrency: 5; RPS: 10
vegeta attack -format json -targets requests-50-50.json -connections 5 -duration 1m -rate 10/1s -timeout 5s | vegeta report
Requests      [total, rate, throughput]         600, 10.02, 8.72
Duration      [total, attack, wait]             1m0s, 59.9s, 160.434ms
Latencies     [min, mean, 50, 90, 95, 99, max]  23.58ms, 135.967ms, 142.852ms, 180.829ms, 192.084ms, 220.733ms, 251.831ms
Bytes In      [total, mean]                     60552096, 100920.16
Bytes Out     [total, mean]                     216228, 360.38
Success       [ratio]                           87.33%
Status Codes  [code:count]                      200:524  500:76  
Error Set:
500 Internal Server Error
Entity rows: 60; Features: 50; Concurrency: 5; RPS: 10
vegeta attack -format json -targets requests-60-50.json -connections 5 -duration 1m -rate 10/1s -timeout 5s | vegeta report
Requests      [total, rate, throughput]         600, 10.02, 8.94
Duration      [total, attack, wait]             1m0s, 59.9s, 151.378ms
Latencies     [min, mean, 50, 90, 95, 99, max]  25.573ms, 152.081ms, 160.234ms, 187.344ms, 203.847ms, 227.544ms, 260.711ms
Bytes In      [total, mean]                     74141125, 123568.54
Bytes Out     [total, mean]                     251628, 419.38
Success       [ratio]                           89.50%
Status Codes  [code:count]                      200:537  500:63  
Error Set:
500 Internal Server Error
Entity rows: 70; Features: 50; Concurrency: 5; RPS: 10
vegeta attack -format json -targets requests-70-50.json -connections 5 -duration 1m -rate 10/1s -timeout 5s | vegeta report
Requests      [total, rate, throughput]         600, 10.02, 8.84
Duration      [total, attack, wait]             1m0s, 59.9s, 172.991ms
Latencies     [min, mean, 50, 90, 95, 99, max]  27.42ms, 167.085ms, 176.616ms, 215.553ms, 227.907ms, 250.992ms, 287.901ms
Bytes In      [total, mean]                     85252593, 142087.65
Bytes Out     [total, mean]                     287042, 478.40
Success       [ratio]                           88.50%
Status Codes  [code:count]                      200:531  500:69  
Error Set:
500 Internal Server Error
Entity rows: 80; Features: 50; Concurrency: 5; RPS: 10
vegeta attack -format json -targets requests-80-50.json -connections 5 -duration 1m -rate 10/1s -timeout 5s | vegeta report
Requests      [total, rate, throughput]         600, 10.02, 8.49
Duration      [total, attack, wait]             1m0s, 59.9s, 259.133ms
Latencies     [min, mean, 50, 90, 95, 99, max]  28.603ms, 180.947ms, 194.708ms, 239.504ms, 252.513ms, 287.479ms, 357.017ms
Bytes In      [total, mean]                     93571475, 155952.46
Bytes Out     [total, mean]                     322213, 537.02
Success       [ratio]                           85.17%
Status Codes  [code:count]                      200:511  500:89  
Error Set:
500 Internal Server Error
Entity rows: 90; Features: 50; Concurrency: 5; RPS: 10
vegeta attack -format json -targets requests-90-50.json -connections 5 -duration 1m -rate 10/1s -timeout 5s | vegeta report
Requests      [total, rate, throughput]         600, 10.02, 7.64
Duration      [total, attack, wait]             1m0s, 59.9s, 292.345ms
Latencies     [min, mean, 50, 90, 95, 99, max]  34.312ms, 197.644ms, 231.982ms, 275.323ms, 284.639ms, 313.741ms, 331.257ms
Bytes In      [total, mean]                     94544344, 157573.91
Bytes Out     [total, mean]                     357646, 596.08
Success       [ratio]                           76.67%
Status Codes  [code:count]                      200:460  500:140  
Error Set:
500 Internal Server Error
Entity rows: 100; Features: 50; Concurrency: 5; RPS: 10
vegeta attack -format json -targets requests-100-50.json -connections 5 -duration 1m -rate 10/1s -timeout 5s | vegeta report
Requests      [total, rate, throughput]         600, 10.02, 7.25
Duration      [total, attack, wait]             1m0s, 59.9s, 345.635ms
Latencies     [min, mean, 50, 90, 95, 99, max]  36.196ms, 207.087ms, 251.376ms, 294.992ms, 310.667ms, 353.78ms, 592.213ms
Bytes In      [total, mean]                     99668706, 166114.51
Bytes Out     [total, mean]                     392988, 654.98
Success       [ratio]                           72.83%
Status Codes  [code:count]                      200:437  500:163  
Error Set:
500 Internal Server Error
Change only number of features
Entity rows: 1; Features: 50; Concurrency: 5; RPS: 10
vegeta attack -format json -targets requests-1-50.json -connections 5 -duration 1m -rate 10/1s -timeout 5s | vegeta report
Requests      [total, rate, throughput]         600, 10.02, 10.01
Duration      [total, attack, wait]             59.933s, 59.9s, 33.168ms
Latencies     [min, mean, 50, 90, 95, 99, max]  27.727ms, 36.577ms, 33.414ms, 46.127ms, 56.95ms, 79.333ms, 128.232ms
Bytes In      [total, mean]                     3202269, 5337.11
Bytes Out     [total, mean]                     43123, 71.87
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:600  
Error Set:
Entity rows: 1; Features: 100; Concurrency: 5; RPS: 10
vegeta attack -format json -targets requests-1-100.json -connections 5 -duration 1m -rate 10/1s -timeout 5s | vegeta report
Requests      [total, rate, throughput]         600, 10.02, 10.01
Duration      [total, attack, wait]             59.967s, 59.9s, 66.568ms
Latencies     [min, mean, 50, 90, 95, 99, max]  51.98ms, 65.905ms, 61.892ms, 80.484ms, 89.695ms, 111.998ms, 151.898ms
Bytes In      [total, mean]                     6329038, 10548.40
Bytes Out     [total, mean]                     43106, 71.84
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:600  
Error Set:
Entity rows: 1; Features: 150; Concurrency: 5; RPS: 10
vegeta attack -format json -targets requests-1-150.json -connections 5 -duration 1m -rate 10/1s -timeout 5s | vegeta report
Requests      [total, rate, throughput]         600, 10.02, 10.00
Duration      [total, attack, wait]             1m0s, 59.9s, 105.605ms
Latencies     [min, mean, 50, 90, 95, 99, max]  74.136ms, 93.485ms, 89.473ms, 111.43ms, 125.983ms, 144.239ms, 168.667ms
Bytes In      [total, mean]                     9486719, 15811.20
Bytes Out     [total, mean]                     43124, 71.87
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:600  
Error Set:
Entity rows: 1; Features: 200; Concurrency: 5; RPS: 10
vegeta attack -format json -targets requests-1-200.json -connections 5 -duration 1m -rate 10/1s -timeout 5s | vegeta report
Requests      [total, rate, throughput]         600, 10.02, 10.00
Duration      [total, attack, wait]             1m0s, 59.9s, 123.877ms
Latencies     [min, mean, 50, 90, 95, 99, max]  98.382ms, 125.129ms, 118.97ms, 151.046ms, 170.305ms, 185.742ms, 308.239ms
Bytes In      [total, mean]                     12645533, 21075.89
Bytes Out     [total, mean]                     43129, 71.88
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:600  
Error Set:
Entity rows: 1; Features: 250; Concurrency: 5; RPS: 10
vegeta attack -format json -targets requests-1-250.json -connections 5 -duration 1m -rate 10/1s -timeout 5s | vegeta report
Requests      [total, rate, throughput]         600, 10.02, 9.99
Duration      [total, attack, wait]             1m0s, 59.9s, 172.447ms
Latencies     [min, mean, 50, 90, 95, 99, max]  124.336ms, 164.515ms, 149.005ms, 186.836ms, 210.941ms, 295.079ms, 4.63s
Bytes In      [total, mean]                     15791566, 26319.28
Bytes Out     [total, mean]                     43124, 71.87
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:600  
Error Set:
Change only number of requests
Entity rows: 1; Features: 50; Concurrency: 5; RPS: 10
vegeta attack -format json -targets requests-1-50.json -connections 5 -duration 1m -rate 10/1s -timeout 5s | vegeta report
Requests      [total, rate, throughput]         600, 10.02, 10.01
Duration      [total, attack, wait]             59.943s, 59.9s, 43.029ms
Latencies     [min, mean, 50, 90, 95, 99, max]  27.699ms, 35.438ms, 33.198ms, 41.49ms, 47.021ms, 67.251ms, 161.347ms
Bytes In      [total, mean]                     3206012, 5343.35
Bytes Out     [total, mean]                     43130, 71.88
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:600  
Error Set:
Entity rows: 1; Features: 50; Concurrency: 5; RPS: 20
vegeta attack -format json -targets requests-1-50.json -connections 5 -duration 1m -rate 20/1s -timeout 5s | vegeta report
Requests      [total, rate, throughput]         1200, 20.02, 20.01
Duration      [total, attack, wait]             59.985s, 59.95s, 34.702ms
Latencies     [min, mean, 50, 90, 95, 99, max]  27.716ms, 34.97ms, 32.907ms, 40.963ms, 46.085ms, 68.911ms, 89.821ms
Bytes In      [total, mean]                     6408988, 5340.82
Bytes Out     [total, mean]                     86280, 71.90
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:1200  
Error Set:
Entity rows: 1; Features: 50; Concurrency: 5; RPS: 30
vegeta attack -format json -targets requests-1-50.json -connections 5 -duration 1m -rate 30/1s -timeout 5s | vegeta report
Requests      [total, rate, throughput]         1800, 30.02, 30.00
Duration      [total, attack, wait]             59.999s, 59.967s, 32.112ms
Latencies     [min, mean, 50, 90, 95, 99, max]  27.778ms, 35.401ms, 33.031ms, 42.081ms, 48.704ms, 73.529ms, 130.241ms
Bytes In      [total, mean]                     9595750, 5330.97
Bytes Out     [total, mean]                     129390, 71.88
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:1800  
Error Set:
Entity rows: 1; Features: 50; Concurrency: 5; RPS: 40
vegeta attack -format json -targets requests-1-50.json -connections 5 -duration 1m -rate 40/1s -timeout 5s | vegeta report
Requests      [total, rate, throughput]         2400, 40.02, 39.99
Duration      [total, attack, wait]             1m0s, 59.975s, 36.024ms
Latencies     [min, mean, 50, 90, 95, 99, max]  27.824ms, 35.454ms, 33.348ms, 41.982ms, 46.731ms, 70.313ms, 104.814ms
Bytes In      [total, mean]                     12823775, 5343.24
Bytes Out     [total, mean]                     172597, 71.92
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:2400  
Error Set:
Entity rows: 1; Features: 50; Concurrency: 5; RPS: 50
vegeta attack -format json -targets requests-1-50.json -connections 5 -duration 1m -rate 50/1s -timeout 5s | vegeta report
Requests      [total, rate, throughput]         3000, 50.02, 49.99
Duration      [total, attack, wait]             1m0s, 59.98s, 29.55ms
Latencies     [min, mean, 50, 90, 95, 99, max]  28.088ms, 35.491ms, 33.322ms, 42.094ms, 47.391ms, 68.893ms, 99.859ms
Bytes In      [total, mean]                     16007076, 5335.69
Bytes Out     [total, mean]                     215712, 71.90
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:3000  
Error Set:
Entity rows: 1; Features: 50; Concurrency: 5; RPS: 60
vegeta attack -format json -targets requests-1-50.json -connections 5 -duration 1m -rate 60/1s -timeout 5s | vegeta report
Requests      [total, rate, throughput]         3600, 60.02, 59.98
Duration      [total, attack, wait]             1m0s, 59.983s, 32.153ms
Latencies     [min, mean, 50, 90, 95, 99, max]  27.831ms, 35.634ms, 33.483ms, 42.036ms, 46.865ms, 69.795ms, 108.938ms
Bytes In      [total, mean]                     19212516, 5336.81
Bytes Out     [total, mean]                     258740, 71.87
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:3600  
Error Set:
Entity rows: 1; Features: 50; Concurrency: 5; RPS: 70
vegeta attack -format json -targets requests-1-50.json -connections 5 -duration 1m -rate 70/1s -timeout 5s | vegeta report
Requests      [total, rate, throughput]         4200, 70.02, 69.98
Duration      [total, attack, wait]             1m0s, 59.986s, 32.55ms
Latencies     [min, mean, 50, 90, 95, 99, max]  28.129ms, 35.614ms, 33.485ms, 41.418ms, 47.171ms, 73.963ms, 145.866ms
Bytes In      [total, mean]                     22420014, 5338.10
Bytes Out     [total, mean]                     301928, 71.89
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:4200  
Error Set:
Entity rows: 1; Features: 50; Concurrency: 5; RPS: 80
vegeta attack -format json -targets requests-1-50.json -connections 5 -duration 1m -rate 80/1s -timeout 5s | vegeta report
Requests      [total, rate, throughput]         4800, 80.02, 79.97
Duration      [total, attack, wait]             1m0s, 59.987s, 37.7ms
Latencies     [min, mean, 50, 90, 95, 99, max]  27.684ms, 35.495ms, 33.685ms, 41.145ms, 45.638ms, 67.19ms, 294.23ms
Bytes In      [total, mean]                     25596500, 5332.60
Bytes Out     [total, mean]                     345037, 71.88
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:4800  
Error Set:
Entity rows: 1; Features: 50; Concurrency: 5; RPS: 90
vegeta attack -format json -targets requests-1-50.json -connections 5 -duration 1m -rate 90/1s -timeout 5s | vegeta report
Requests      [total, rate, throughput]         5400, 90.02, 89.97
Duration      [total, attack, wait]             1m0s, 59.989s, 31.342ms
Latencies     [min, mean, 50, 90, 95, 99, max]  28.426ms, 36.765ms, 34.377ms, 44.411ms, 50.384ms, 72.95ms, 93.789ms
Bytes In      [total, mean]                     28840647, 5340.86
Bytes Out     [total, mean]                     388308, 71.91
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:5400  
Error Set:
Entity rows: 1; Features: 50; Concurrency: 5; RPS: 100
vegeta attack -format json -targets requests-1-50.json -connections 5 -duration 1m -rate 100/1s -timeout 5s | vegeta report
Requests      [total, rate, throughput]         6000, 100.02, 99.94
Duration      [total, attack, wait]             1m0s, 59.99s, 43.528ms
Latencies     [min, mean, 50, 90, 95, 99, max]  28.521ms, 37.596ms, 34.868ms, 45.942ms, 54.513ms, 78.657ms, 270.907ms
Bytes In      [total, mean]                     32012527, 5335.42
Bytes Out     [total, mean]                     431310, 71.89
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:6000  
Error Set:
Entity rows: 1; Features: 250; Concurrency: 5; RPS: 10
vegeta attack -format json -targets requests-1-250.json -connections 5 -duration 1m -rate 10/1s -timeout 5s | vegeta report
Requests      [total, rate, throughput]         600, 10.02, 9.99
Duration      [total, attack, wait]             1m0s, 59.9s, 140.641ms
Latencies     [min, mean, 50, 90, 95, 99, max]  123.39ms, 153.921ms, 148.086ms, 186.353ms, 202.033ms, 221.54ms, 305.297ms
Bytes In      [total, mean]                     15806171, 26343.62
Bytes Out     [total, mean]                     43134, 71.89
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:600  
Error Set:
Entity rows: 1; Features: 250; Concurrency: 5; RPS: 20
vegeta attack -format json -targets requests-1-250.json -connections 5 -duration 1m -rate 20/1s -timeout 5s | vegeta report
Requests      [total, rate, throughput]         1200, 20.02, 19.96
Duration      [total, attack, wait]             1m0s, 59.95s, 166.838ms
Latencies     [min, mean, 50, 90, 95, 99, max]  123.4ms, 155.993ms, 151.056ms, 185.201ms, 199.407ms, 227.5ms, 382.459ms
Bytes In      [total, mean]                     31589050, 26324.21
Bytes Out     [total, mean]                     86260, 71.88
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:1200  
Error Set:
Entity rows: 1; Features: 250; Concurrency: 5; RPS: 30
vegeta attack -format json -targets requests-1-250.json -connections 5 -duration 1m -rate 30/1s -timeout 5s | vegeta report
Requests      [total, rate, throughput]         1800, 30.02, 29.95
Duration      [total, attack, wait]             1m0s, 59.967s, 136.116ms
Latencies     [min, mean, 50, 90, 95, 99, max]  119.986ms, 166.754ms, 158.19ms, 201.317ms, 219.435ms, 267.18ms, 1.295s
Bytes In      [total, mean]                     47435587, 26353.10
Bytes Out     [total, mean]                     129403, 71.89
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:1800  
Error Set:
Entity rows: 1; Features: 250; Concurrency: 5; RPS: 40
vegeta attack -format json -targets requests-1-250.json -connections 5 -duration 1m -rate 40/1s -timeout 5s | vegeta report
Requests      [total, rate, throughput]         2400, 40.02, 39.91
Duration      [total, attack, wait]             1m0s, 59.975s, 163.503ms
Latencies     [min, mean, 50, 90, 95, 99, max]  127.325ms, 171.883ms, 163.182ms, 208.642ms, 229.955ms, 320.879ms, 647.105ms
Bytes In      [total, mean]                     63195249, 26331.35
Bytes Out     [total, mean]                     172513, 71.88
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:2400  
Error Set:
Entity rows: 1; Features: 250; Concurrency: 5; RPS: 50
vegeta attack -format json -targets requests-1-250.json -connections 5 -duration 1m -rate 50/1s -timeout 5s | vegeta report
Requests      [total, rate, throughput]         3000, 50.02, 49.89
Duration      [total, attack, wait]             1m0s, 59.98s, 151.068ms
Latencies     [min, mean, 50, 90, 95, 99, max]  129.852ms, 169.995ms, 163.32ms, 204.456ms, 220.938ms, 250.323ms, 468.569ms
Bytes In      [total, mean]                     78976217, 26325.41
Bytes Out     [total, mean]                     215663, 71.89
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:3000  
Error Set:
Entity rows: 1; Features: 250; Concurrency: 5; RPS: 60
vegeta attack -format json -targets requests-1-250.json -connections 5 -duration 1m -rate 60/1s -timeout 5s | vegeta report
Requests      [total, rate, throughput]         3600, 60.02, 59.87
Duration      [total, attack, wait]             1m0s, 59.983s, 142.393ms
Latencies     [min, mean, 50, 90, 95, 99, max]  127.979ms, 176.557ms, 169.856ms, 210.136ms, 225.27ms, 256.492ms, 476.611ms
Bytes In      [total, mean]                     94746903, 26318.58
Bytes Out     [total, mean]                     258872, 71.91
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:3600  
Error Set:
Entity rows: 1; Features: 250; Concurrency: 5; RPS: 70
vegeta attack -format json -targets requests-1-250.json -connections 5 -duration 1m -rate 70/1s -timeout 5s | vegeta report
Requests      [total, rate, throughput]         4200, 70.02, 69.56
Duration      [total, attack, wait]             1m0s, 59.986s, 397.488ms
Latencies     [min, mean, 50, 90, 95, 99, max]  135.947ms, 184.444ms, 176.941ms, 219.191ms, 235.514ms, 291.255ms, 561.469ms
Bytes In      [total, mean]                     110663517, 26348.46
Bytes Out     [total, mean]                     301993, 71.90
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:4200  
Error Set:
Entity rows: 1; Features: 250; Concurrency: 5; RPS: 80
vegeta attack -format json -targets requests-1-250.json -connections 5 -duration 1m -rate 80/1s -timeout 5s | vegeta report
Requests      [total, rate, throughput]         4800, 80.02, 79.78
Duration      [total, attack, wait]             1m0s, 59.987s, 175.136ms
Latencies     [min, mean, 50, 90, 95, 99, max]  138.297ms, 200.499ms, 187.872ms, 252.078ms, 274.598ms, 341.284ms, 1.653s
Bytes In      [total, mean]                     126334264, 26319.64
Bytes Out     [total, mean]                     345075, 71.89
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:4800  
Error Set:
Entity rows: 1; Features: 250; Concurrency: 5; RPS: 90
vegeta attack -format json -targets requests-1-250.json -connections 5 -duration 1m -rate 90/1s -timeout 5s | vegeta report
Requests      [total, rate, throughput]         5400, 90.02, 89.70
Duration      [total, attack, wait]             1m0s, 59.989s, 211.429ms
Latencies     [min, mean, 50, 90, 95, 99, max]  137.552ms, 239.537ms, 234.119ms, 292.624ms, 312.392ms, 352.203ms, 540.189ms
Bytes In      [total, mean]                     142259803, 26344.41
Bytes Out     [total, mean]                     388200, 71.89
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:5400  
Error Set:
Entity rows: 1; Features: 250; Concurrency: 5; RPS: 100
vegeta attack -format json -targets requests-1-250.json -connections 5 -duration 1m -rate 100/1s -timeout 5s | vegeta report
Requests      [total, rate, throughput]         6000, 100.02, 54.64
Duration      [total, attack, wait]             1m5s, 59.99s, 5s
Latencies     [min, mean, 50, 90, 95, 99, max]  162.45ms, 2.772s, 2.959s, 5s, 5s, 5s, 5.01s
Bytes In      [total, mean]                     93476070, 15579.34
Bytes Out     [total, mean]                     255329, 42.55
Success       [ratio]                           59.18%
Status Codes  [code:count]                      0:2449  200:3551  
Error Set:
Post "http://127.0.0.1:6567/get-online-features": context deadline exceeded (Client.Timeout exceeded while awaiting headers)
Post "http://127.0.0.1:6568/get-online-features": context deadline exceeded (Client.Timeout exceeded while awaiting headers)
Post "http://127.0.0.1:6571/get-online-features": context deadline exceeded (Client.Timeout exceeded while awaiting headers)
Post "http://127.0.0.1:6570/get-online-features": context deadline exceeded (Client.Timeout exceeded while awaiting headers)
Post "http://127.0.0.1:6572/get-online-features": context deadline exceeded (Client.Timeout exceeded while awaiting headers)
Post "http://127.0.0.1:6579/get-online-features": context deadline exceeded (Client.Timeout exceeded while awaiting headers)
Post "http://127.0.0.1:6566/get-online-features": context deadline exceeded (Client.Timeout exceeded while awaiting headers)
Post "http://127.0.0.1:6569/get-online-features": context deadline exceeded (Client.Timeout exceeded while awaiting headers)
Post "http://127.0.0.1:6576/get-online-features": context deadline exceeded (Client.Timeout exceeded while awaiting headers)
Post "http://127.0.0.1:6578/get-online-features": context deadline exceeded (Client.Timeout exceeded while awaiting headers)
Post "http://127.0.0.1:6574/get-online-features": context deadline exceeded (Client.Timeout exceeded while awaiting headers)
Post "http://127.0.0.1:6575/get-online-features": context deadline exceeded (Client.Timeout exceeded while awaiting headers)
Post "http://127.0.0.1:6573/get-online-features": context deadline exceeded (Client.Timeout exceeded while awaiting headers)
Post "http://127.0.0.1:6577/get-online-features": context deadline exceeded (Client.Timeout exceeded while awaiting headers)
Post "http://127.0.0.1:6581/get-online-features": context deadline exceeded (Client.Timeout exceeded while awaiting headers)
Entity rows: 100; Features: 50; Concurrency: 5; RPS: 10
vegeta attack -format json -targets requests-100-50.json -connections 5 -duration 1m -rate 10/1s -timeout 5s | vegeta report
Requests      [total, rate, throughput]         600, 10.02, 7.22
Duration      [total, attack, wait]             1m0s, 59.9s, 242.125ms
Latencies     [min, mean, 50, 90, 95, 99, max]  36.272ms, 259.423ms, 253.426ms, 312.147ms, 349.608ms, 2.61s, 3.47s
Bytes In      [total, mean]                     98992895, 164988.16
Bytes Out     [total, mean]                     392976, 654.96
Success       [ratio]                           72.33%
Status Codes  [code:count]                      200:434  500:166  
Error Set:
500 Internal Server Error
Entity rows: 100; Features: 50; Concurrency: 5; RPS: 20
vegeta attack -format json -targets requests-100-50.json -connections 5 -duration 1m -rate 20/1s -timeout 5s | vegeta report
Requests      [total, rate, throughput]         1200, 20.02, 15.05
Duration      [total, attack, wait]             1m0s, 59.95s, 263.96ms
Latencies     [min, mean, 50, 90, 95, 99, max]  36.838ms, 225.564ms, 264.283ms, 317.956ms, 338.865ms, 386.885ms, 513.554ms
Bytes In      [total, mean]                     206580816, 172150.68
Bytes Out     [total, mean]                     785941, 654.95
Success       [ratio]                           75.50%
Status Codes  [code:count]                      200:906  500:294  
Error Set:
500 Internal Server Error
Entity rows: 100; Features: 50; Concurrency: 5; RPS: 30
vegeta attack -format json -targets requests-100-50.json -connections 5 -duration 1m -rate 30/1s -timeout 5s | vegeta report
Requests      [total, rate, throughput]         1800, 30.02, 22.38
Duration      [total, attack, wait]             1m0s, 59.967s, 169.229ms
Latencies     [min, mean, 50, 90, 95, 99, max]  35.261ms, 235.19ms, 278.53ms, 337.377ms, 355.034ms, 393.451ms, 462.003ms
Bytes In      [total, mean]                     306925884, 170514.38
Bytes Out     [total, mean]                     1178963, 654.98
Success       [ratio]                           74.78%
Status Codes  [code:count]                      200:1346  500:454  
Error Set:
500 Internal Server Error
Entity rows: 100; Features: 50; Concurrency: 5; RPS: 40
vegeta attack -format json -targets requests-100-50.json -connections 5 -duration 1m -rate 40/1s -timeout 5s | vegeta report
Requests      [total, rate, throughput]         2400, 40.02, 30.26
Duration      [total, attack, wait]             1m0s, 59.975s, 267.462ms
Latencies     [min, mean, 50, 90, 95, 99, max]  36.586ms, 258.935ms, 305.131ms, 367.558ms, 390.102ms, 430.318ms, 600.154ms
Bytes In      [total, mean]                     415780909, 173242.05
Bytes Out     [total, mean]                     1571528, 654.80
Success       [ratio]                           75.96%
Status Codes  [code:count]                      200:1823  500:577  
Error Set:
500 Internal Server Error
Entity rows: 100; Features: 50; Concurrency: 5; RPS: 50
vegeta attack -format json -targets requests-100-50.json -connections 5 -duration 1m -rate 50/1s -timeout 5s | vegeta report
Requests      [total, rate, throughput]         3000, 50.02, 36.77
Duration      [total, attack, wait]             1m0s, 59.98s, 447.197ms
Latencies     [min, mean, 50, 90, 95, 99, max]  39.325ms, 329.76ms, 363.958ms, 490.957ms, 519.67ms, 571.284ms, 1.023s
Bytes In      [total, mean]                     506758848, 168919.62
Bytes Out     [total, mean]                     1964973, 654.99
Success       [ratio]                           74.07%
Status Codes  [code:count]                      200:2222  500:778  
Error Set:
500 Internal Server Error
Entity rows: 100; Features: 50; Concurrency: 5; RPS: 60
vegeta attack -format json -targets requests-100-50.json -connections 5 -duration 1m -rate 60/1s -timeout 5s | vegeta report
Requests      [total, rate, throughput]         3600, 60.02, 26.03
Duration      [total, attack, wait]             1m5s, 59.983s, 4.984s
Latencies     [min, mean, 50, 90, 95, 99, max]  49.157ms, 2.739s, 2.645s, 5s, 5s, 5s, 5.004s
Bytes In      [total, mean]                     385675185, 107132.00
Bytes Out     [total, mean]                     1657865, 460.52
Success       [ratio]                           46.97%
Status Codes  [code:count]                      0:1069  200:1691  500:840  
Error Set:
500 Internal Server Error
Post "http://127.0.0.1:6570/get-online-features": context deadline exceeded (Client.Timeout exceeded while awaiting headers)
Post "http://127.0.0.1:6567/get-online-features": context deadline exceeded (Client.Timeout exceeded while awaiting headers)
Post "http://127.0.0.1:6579/get-online-features": context deadline exceeded (Client.Timeout exceeded while awaiting headers)
Post "http://127.0.0.1:6566/get-online-features": context deadline exceeded (Client.Timeout exceeded while awaiting headers)
Post "http://127.0.0.1:6575/get-online-features": context deadline exceeded (Client.Timeout exceeded while awaiting headers)
Post "http://127.0.0.1:6568/get-online-features": context deadline exceeded (Client.Timeout exceeded while awaiting headers)
Post "http://127.0.0.1:6571/get-online-features": context deadline exceeded (Client.Timeout exceeded while awaiting headers)
Post "http://127.0.0.1:6581/get-online-features": context deadline exceeded (Client.Timeout exceeded while awaiting headers)
Post "http://127.0.0.1:6580/get-online-features": context deadline exceeded (Client.Timeout exceeded while awaiting headers)
Post "http://127.0.0.1:6574/get-online-features": context deadline exceeded (Client.Timeout exceeded while awaiting headers)
Post "http://127.0.0.1:6572/get-online-features": context deadline exceeded (Client.Timeout exceeded while awaiting headers)
Post "http://127.0.0.1:6578/get-online-features": context deadline exceeded (Client.Timeout exceeded while awaiting headers)
Post "http://127.0.0.1:6577/get-online-features": context deadline exceeded (Client.Timeout exceeded while awaiting headers)
context deadline exceeded (Client.Timeout or context cancellation while reading body)
Entity rows: 100; Features: 50; Concurrency: 5; RPS: 70
vegeta attack -format json -targets requests-100-50.json -connections 5 -duration 1m -rate 70/1s -timeout 5s | vegeta report
Requests      [total, rate, throughput]         4200, 70.02, 6.74
Duration      [total, attack, wait]             1m5s, 59.986s, 5s
Latencies     [min, mean, 50, 90, 95, 99, max]  51.028ms, 4.523s, 5s, 5s, 5s, 5s, 5.005s
Bytes In      [total, mean]                     99913888, 23789.02
Bytes Out     [total, mean]                     553531, 131.79
Success       [ratio]                           10.43%
Status Codes  [code:count]                      0:3355  200:438  500:407  
Error Set:
500 Internal Server Error
Post "http://127.0.0.1:6567/get-online-features": context deadline exceeded (Client.Timeout exceeded while awaiting headers)
Post "http://127.0.0.1:6570/get-online-features": context deadline exceeded (Client.Timeout exceeded while awaiting headers)
Post "http://127.0.0.1:6579/get-online-features": context deadline exceeded (Client.Timeout exceeded while awaiting headers)
context deadline exceeded (Client.Timeout or context cancellation while reading body)
Post "http://127.0.0.1:6571/get-online-features": context deadline exceeded (Client.Timeout exceeded while awaiting headers)
Post "http://127.0.0.1:6575/get-online-features": context deadline exceeded (Client.Timeout exceeded while awaiting headers)
Post "http://127.0.0.1:6574/get-online-features": context deadline exceeded (Client.Timeout exceeded while awaiting headers)
Post "http://127.0.0.1:6576/get-online-features": context deadline exceeded (Client.Timeout exceeded while awaiting headers)
Post "http://127.0.0.1:6578/get-online-features": context deadline exceeded (Client.Timeout exceeded while awaiting headers)
Post "http://127.0.0.1:6577/get-online-features": context deadline exceeded (Client.Timeout exceeded while awaiting headers)
Post "http://127.0.0.1:6581/get-online-features": context deadline exceeded (Client.Timeout exceeded while awaiting headers)
Post "http://127.0.0.1:6569/get-online-features": context deadline exceeded (Client.Timeout exceeded while awaiting headers)
Post "http://127.0.0.1:6572/get-online-features": context deadline exceeded (Client.Timeout exceeded while awaiting headers)
Post "http://127.0.0.1:6573/get-online-features": context deadline exceeded (Client.Timeout exceeded while awaiting headers)
Post "http://127.0.0.1:6580/get-online-features": context deadline exceeded (Client.Timeout exceeded while awaiting headers)
Post "http://127.0.0.1:6566/get-online-features": context deadline exceeded (Client.Timeout exceeded while awaiting headers)
Post "http://127.0.0.1:6568/get-online-features": context deadline exceeded (Client.Timeout exceeded while awaiting headers)
Entity rows: 100; Features: 50; Concurrency: 5; RPS: 80
vegeta attack -format json -targets requests-100-50.json -connections 5 -duration 1m -rate 80/1s -timeout 5s | vegeta report
Requests      [total, rate, throughput]         4800, 80.02, 0.00
Duration      [total, attack, wait]             1m5s, 59.985s, 4.988s
Latencies     [min, mean, 50, 90, 95, 99, max]  2.427s, 4.965s, 5s, 5s, 5s, 5s, 5.006s
Bytes In      [total, mean]                     17710, 3.69
Bytes Out     [total, mean]                     105554, 21.99
Success       [ratio]                           0.00%
Status Codes  [code:count]                      0:4639  500:161  
Error Set:
500 Internal Server Error
Post "http://127.0.0.1:6566/get-online-features": context deadline exceeded (Client.Timeout exceeded while awaiting headers)
Post "http://127.0.0.1:6567/get-online-features": context deadline exceeded (Client.Timeout exceeded while awaiting headers)
Post "http://127.0.0.1:6568/get-online-features": context deadline exceeded (Client.Timeout exceeded while awaiting headers)
Post "http://127.0.0.1:6569/get-online-features": context deadline exceeded (Client.Timeout exceeded while awaiting headers)
Post "http://127.0.0.1:6570/get-online-features": context deadline exceeded (Client.Timeout exceeded while awaiting headers)
Post "http://127.0.0.1:6571/get-online-features": context deadline exceeded (Client.Timeout exceeded while awaiting headers)
Post "http://127.0.0.1:6572/get-online-features": context deadline exceeded (Client.Timeout exceeded while awaiting headers)
Post "http://127.0.0.1:6573/get-online-features": context deadline exceeded (Client.Timeout exceeded while awaiting headers)
Post "http://127.0.0.1:6574/get-online-features": context deadline exceeded (Client.Timeout exceeded while awaiting headers)
Post "http://127.0.0.1:6575/get-online-features": context deadline exceeded (Client.Timeout exceeded while awaiting headers)
Post "http://127.0.0.1:6576/get-online-features": context deadline exceeded (Client.Timeout exceeded while awaiting headers)
Post "http://127.0.0.1:6577/get-online-features": context deadline exceeded (Client.Timeout exceeded while awaiting headers)
Post "http://127.0.0.1:6578/get-online-features": context deadline exceeded (Client.Timeout exceeded while awaiting headers)
Post "http://127.0.0.1:6579/get-online-features": context deadline exceeded (Client.Timeout exceeded while awaiting headers)
Post "http://127.0.0.1:6581/get-online-features": context deadline exceeded (Client.Timeout exceeded while awaiting headers)
Post "http://127.0.0.1:6580/get-online-features": context deadline exceeded (Client.Timeout exceeded while awaiting headers)
Entity rows: 100; Features: 50; Concurrency: 5; RPS: 90
vegeta attack -format json -targets requests-100-50.json -connections 5 -duration 1m -rate 90/1s -timeout 5s | vegeta report
Requests      [total, rate, throughput]         5400, 90.02, 0.00
Duration      [total, attack, wait]             1m5s, 59.988s, 5s
Latencies     [min, mean, 50, 90, 95, 99, max]  2.349s, 4.968s, 5s, 5s, 5s, 5s, 5.004s
Bytes In      [total, mean]                     20790, 3.85
Bytes Out     [total, mean]                     123790, 22.92
Success       [ratio]                           0.00%
Status Codes  [code:count]                      0:5211  500:189  
Error Set:
500 Internal Server Error
Post "http://127.0.0.1:6566/get-online-features": context deadline exceeded (Client.Timeout exceeded while awaiting headers)
Post "http://127.0.0.1:6567/get-online-features": context deadline exceeded (Client.Timeout exceeded while awaiting headers)
Post "http://127.0.0.1:6568/get-online-features": context deadline exceeded (Client.Timeout exceeded while awaiting headers)
Post "http://127.0.0.1:6569/get-online-features": context deadline exceeded (Client.Timeout exceeded while awaiting headers)
Post "http://127.0.0.1:6570/get-online-features": context deadline exceeded (Client.Timeout exceeded while awaiting headers)
Post "http://127.0.0.1:6571/get-online-features": context deadline exceeded (Client.Timeout exceeded while awaiting headers)
Post "http://127.0.0.1:6572/get-online-features": context deadline exceeded (Client.Timeout exceeded while awaiting headers)
Post "http://127.0.0.1:6573/get-online-features": context deadline exceeded (Client.Timeout exceeded while awaiting headers)
Post "http://127.0.0.1:6574/get-online-features": context deadline exceeded (Client.Timeout exceeded while awaiting headers)
Post "http://127.0.0.1:6575/get-online-features": context deadline exceeded (Client.Timeout exceeded while awaiting headers)
Post "http://127.0.0.1:6576/get-online-features": context deadline exceeded (Client.Timeout exceeded while awaiting headers)
Post "http://127.0.0.1:6577/get-online-features": context deadline exceeded (Client.Timeout exceeded while awaiting headers)
Post "http://127.0.0.1:6578/get-online-features": context deadline exceeded (Client.Timeout exceeded while awaiting headers)
Post "http://127.0.0.1:6579/get-online-features": context deadline exceeded (Client.Timeout exceeded while awaiting headers)
Post "http://127.0.0.1:6580/get-online-features": context deadline exceeded (Client.Timeout exceeded while awaiting headers)
Post "http://127.0.0.1:6581/get-online-features": context deadline exceeded (Client.Timeout exceeded while awaiting headers)
Entity rows: 100; Features: 50; Concurrency: 5; RPS: 100
vegeta attack -format json -targets requests-100-50.json -connections 5 -duration 1m -rate 100/1s -timeout 5s | vegeta report
Requests      [total, rate, throughput]         6000, 100.02, 0.00
Duration      [total, attack, wait]             1m5s, 59.99s, 5s
Latencies     [min, mean, 50, 90, 95, 99, max]  2.758s, 4.975s, 5s, 5s, 5s, 5s, 5.004s
Bytes In      [total, mean]                     18700, 3.12
Bytes Out     [total, mean]                     111250, 18.54
Success       [ratio]                           0.00%
Status Codes  [code:count]                      0:5830  500:170  
Error Set:
500 Internal Server Error
Post "http://127.0.0.1:6566/get-online-features": context deadline exceeded (Client.Timeout exceeded while awaiting headers)
Post "http://127.0.0.1:6567/get-online-features": context deadline exceeded (Client.Timeout exceeded while awaiting headers)
Post "http://127.0.0.1:6568/get-online-features": context deadline exceeded (Client.Timeout exceeded while awaiting headers)
Post "http://127.0.0.1:6569/get-online-features": context deadline exceeded (Client.Timeout exceeded while awaiting headers)
Post "http://127.0.0.1:6570/get-online-features": context deadline exceeded (Client.Timeout exceeded while awaiting headers)
Post "http://127.0.0.1:6571/get-online-features": context deadline exceeded (Client.Timeout exceeded while awaiting headers)
Post "http://127.0.0.1:6572/get-online-features": context deadline exceeded (Client.Timeout exceeded while awaiting headers)
Post "http://127.0.0.1:6573/get-online-features": context deadline exceeded (Client.Timeout exceeded while awaiting headers)
Post "http://127.0.0.1:6574/get-online-features": context deadline exceeded (Client.Timeout exceeded while awaiting headers)
Post "http://127.0.0.1:6575/get-online-features": context deadline exceeded (Client.Timeout exceeded while awaiting headers)
Post "http://127.0.0.1:6576/get-online-features": context deadline exceeded (Client.Timeout exceeded while awaiting headers)
Post "http://127.0.0.1:6577/get-online-features": context deadline exceeded (Client.Timeout exceeded while awaiting headers)
Post "http://127.0.0.1:6578/get-online-features": context deadline exceeded (Client.Timeout exceeded while awaiting headers)
Post "http://127.0.0.1:6579/get-online-features": context deadline exceeded (Client.Timeout exceeded while awaiting headers)
Post "http://127.0.0.1:6581/get-online-features": context deadline exceeded (Client.Timeout exceeded while awaiting headers)
Post "http://127.0.0.1:6580/get-online-features": context deadline exceeded (Client.Timeout exceeded while awaiting headers)
Entity rows: 100; Features: 250; Concurrency: 5; RPS: 10
vegeta attack -format json -targets requests-100-250.json -connections 5 -duration 1m -rate 10/1s -timeout 5s | vegeta report